local localization = {
    ["pc_stockmarket"] = "股票市场", -- Stock market internet button

    ["login_name"] = "用户名", -- Login "Name"
    ["login_password"] = "密码", -- Login "Password"
    ["login_login"] = "登录", -- Login button

    ["button_home"] = "主页", -- Home menu button
    ["button_stocks"] = "股票", -- Stocks menu button
    ["button_portfolio"] = "投资组合", -- Portfolio menu button
    ["button_logout"] = "注销", -- Logout menu button
    ["button_news"] = "新闻", -- News menu button

    ["graph_time"] = "时间", -- Graph X Axis label
    ["graph_value"] = "市值", -- Graph Y Axis label

    ["info_value"] = "价值", -- Stock page "Value" text
    ["info_buy"] = "买入", -- Stock page buy button
    ["info_sell"] = "出售", -- Stock page sell button
    ["info_owned"] = "账目", -- Stock "In Account" (Currently owned stocks) text
    ["info_transaction"] = "交易成本", -- Transaction cost text
    ["info_post_portfolio"] = "交易后余额", -- Total wealth / money after transaction text
    ["info_margin"] = "利润", -- Profit text

    ["portfolio_accountValue"] = "走势", -- Portfolio graph Y Axis label
    ["portfolio_ownedStocks"] = "持仓数", -- Portfolio owned stocks list description
    ["portfolio_totalMoney"] = "总金额", -- Portfolio total player money info
    ["portfolio_moneyInStocks"] = "持有额", -- Portfolio amount of money invested in stocks info

    ["news_toggleNotification"] = "电话通知", -- News page toggle phone news botifications button
    ["news_contactName"] = "网络新闻 N54", -- News contact name (NN54 Breaking News)

    ["stockInfo_All Foods"] = "全食品工厂是一家总部位于墨西哥的公司，专注于为客户提供现成的优质食品（通常为肉类食品）。全食品工厂的大部分产品及其销售都稍往美国。",
    ["stockInfo_Arasaka"] = "荒坂集团是一家来自日本的家族企业。他们为企业巨头提供安保、银行和法律服务，是2077年最有影响力的巨型财团之一。荒坂出品的武器和载具是执法部门和安保武装们孜孜以求的尖货。",
    ["stockInfo_Asukaga"] = "阿斯卡加与芬奇是一家位于新美利坚纽约的独家投资和金融咨询公司。该公司以代表其全球客户处理和投资巨额资金而闻名。",
    ["stockInfo_Biotechnica"] = "生物技术是一家专精基因工程和生物技术、制药与微生物研究的公司。正是在生物技术的实验室中，全球顶尖的专家们用突破性的发现，将世界从能源危机的边缘拉了回来。是什么发现？CHOOH2，用转基因小麦制作的合成酒精。这款专利使公司成为了市场上的重要角色。",
    ["stockInfo_Budget Arms"] = "平价火力是一家武器制造公司。专门制造极为廉价且价格低廉的武器，甚至可以从自动售货机上买到。由于低成本价值主张，武器的可靠性和性能不是主要焦点。",
    ["stockInfo_Cytech"] = "网科是一家专营植入体和赛博假肢的科技和生物技术公司。网科以产品质量出众著称，所有的专利解决方案都是在公司实验室里自行研发的。",
    ["stockInfo_Darra Poly"] = "达拉理工是一家总部位于印度的廉价时尚武器制造商。他们的武器通常以产生足够能量从地球上看到的猛烈星际事件命名。",
    ["stockInfo_Delamain"] = "德拉曼是夜之城唯一一家由人工智能管理，将乘客的安全和舒适视为头等大事的出租车服务公司。光是德拉曼妙趣横生的性格就足以让他成为你旅行的良伴。通过高效的管理和创新的技术，他在提升服务质量方面的追求永无止境，同样不失为一位杰出的商业伙伴。",
    ["stockInfo_DMS"] = "DMS是赛博朋克系列中仅次于网络新闻54的第二大媒体公司。众所周知，两家公司的冲突不断。DMS广为人知的贡献有：参与发行了第一部娱乐超梦。",
    ["stockInfo_DTR"] = "深入巨头公司，简称DTR，是一家从事货运业务的公司，以其现代航运船队而闻名。2076年期间，该公司处理了美国53%的运输业务。现在DTR是世界上最大的航运公司之一。",
    ["stockInfo_Dynalar"] = "迪纳拉科技是一家义体制作公司。他们制造义体植入物，专门为女性制造镀铬控制臂。许多著名的BD明星都佩戴迪纳拉制造的镀铬手臂。",
    ["stockInfo_NC ETF"] = "",
    ["stockInfo_EZHomes"] = "轻松入宅在夜城的所有地区提供住房。它提供了一种简单、无纸化的进出方式，以其经常不受欢迎的客户而闻名。他们甚至在一些夜城最富有的地区提供高端公寓。",
    ["stockInfo_Kang Tao"] = "康陶是一家华人公司，也是世界上最大的武器制造商之一。多年来，康陶不断推出市面上最先进的技术，逐渐巩固了自己作为荒坂竞争对手的地位。在同时适合军用和民用的优质武器装备领域，这家公司的表现始终超出客户期待。但最值得一提的还是康陶在智能级武器和武器系统研发、专利和生产方面的出色表现。他们在这个细分市场是毫无争议的第一。",
    ["stockInfo_Kaukaz"] = "高加索是一家来自苏联的苏联汽车制造商。该公司主要生产工业卡车，如高加索勃拉茨克 U4020。他们的车辆通常被军队购买用于重型工作。",
    ["stockInfo_Kiroshi"] = "岐路司光学是一家起源于长野县山区的日本公司。这是一个相对较小的日本企业集团，专门从事义体，它被广泛认为是生产光学网络软件的领先专家。",
    ["stockInfo_Lazarus"] = "拉撒路军事行动集团是一家完全专注于私人军事合同的大型公司，其业务遍及全球，从单个作战人员到整个装甲师。该集团最坚定的企业盟友是军用科技。",
    ["stockInfo_Militech"] = "军用科技国际军备是世界上规模最大、最有权势的公司之一。他们在新美利坚主要以支持联邦政府著称，为政府提供了包括武器和专用军事装备在内的人力和设备支持，还同样涉足私营业务，负责安保以及攻防战斗服务。公司可以为客户提供最新的设备、技术过硬的职员和装备精良、训练有素的特工，借此完成任务。另外，这家超级公司还自主研发和生产枪械、无人机、植入体，甚至是适合陆海空作战的载具。",
    ["stockInfo_MoorE"] = "摩尔科技是一家瑞士义体制造商。摩尔以全身转换而闻名，其客户中有名人利琪·薇兹",
    ["stockInfo_NCorp"] = "夜氏公司是一家独特的公司，专注于夜之城及其事务。该公司是本市最大的公共采购承包商，主要负责修建和翻新道路、桥梁、隧道、地铁线路、发电厂、网络发送器、自来水厂和下水道等公共设施。该公司还因儿童慈善机构和惠及天才青年的奖学金项目而闻名。此外，夜氏公司也在生态学和替代能源的研究上投入了巨资。",
    ["stockInfo_NCPD"] = "NCPD夜之城警察局由公司提供经济支持的警察机关，警队的官方赞助商是夜氏公司，不过NCPD也亏欠了荒坂和军用科技不少好处。NCPD负责夜之城的公共安全。在保障企业经商环境的大前提下，尽量维护城市的稳定，这就是他们存在的意义。",
    ["stockInfo_Netwatch"] = "网络监察是设立于英国伦敦的警务组织。它的主要职责是保护欧洲与美国的网络安全。网络监察与公司有着密切的合作，并且经常与网络黑客发生冲突。这些“网络警察”专职保护数据要塞、追捕无照 AI、消灭破解入侵、移除软件威胁、逮捕惹是生非的网络黑客。网络监察还负责维护黑墙，一道抵挡后大崩溃流窜 AI 的 ICE 屏障。",
    ["stockInfo_NN54"] = "网络新闻N54是赛博朋克系列中一家覆盖新美利坚的巨型企业，主要从事媒体行业。54网络从2010年起控制了其所在地区62%的广播业股份，提供新闻、电影、电视节目，并几乎垄断了行业。",
    ["stockInfo_Orbital Air"] = "轨道航空成立于21世纪初的肯尼亚内罗毕，是地球轨道商业运输领域规模最大、历史最悠久的公司。其赫耳墨斯号是欧洲太空理事会首次送入太空的航天飞机。同样也是轨道航空首先投资月球殖民，为人类探索最后的边疆打开了大门。",
    ["stockInfo_Petrochem"] = "沛卓石化是一家大型公司，其主要业务是石化行业。通过和生物工程企业生物技术建立合作伙伴关系，沛卓石化得以将种植在该公司数百万由良田上的转基因小麦转化为未来的生物燃料CHOOH2。另外，它还具有自行种植改良谷物的有限权。也就是说，要想脱离沛卓石化是不现实的。虽然不用过分强调沛卓石化的影响力和资源，但竞争对手们十分清楚这家超级公司的经济和政治实力。",
    ["stockInfo_QianT"] = "千替是康陶旗下的高端义体制造商。尽管千替主要被康陶用作空壳公司来处理他们自己无法公开关联的敏感业务。",
    ["stockInfo_Quadra"] = "古德拉是一家汽车制造商，专为大众消费者生产复古风格的跑车。该公司擅长设计和制造肌肉车，如66式或其最具标志性的Turbo-R。",
    ["stockInfo_Raven"] = "乌鸦微控是一家致力于义体业务的公司。其总部位于夜之城。乌鸦微控是美国义体、硬软件和控制电子产品的主要制造商之一，以总是在义体的前沿冲浪而闻名。",
    ["stockInfo_Rayfield"] = "雷菲尔德是一家汽车制造商，以其高品质跑车和豪华轿车而闻名，他们只为最富有的群体生产高端的超级跑车。顶尖技术也被用于其车辆的生产，如有石中剑。该公司的旗舰车型是湖女之剑-桂妮薇儿。",
    ["stockInfo_Thorton"] = "霆威公司以其广泛的多用途车（包括皮卡或货车）而闻名。它们还以其中级乘用车而闻名，其中大部分是在2020年至2050年间首次生产和发布的。",
    ["stockInfo_Trauma Team"] = "创伤小组是夜之城最大的医疗服务供应商，业务涵盖保健产品、医疗保险、医疗级植入体以及置换手术。公信力如此高的公司，很可能只有这么一家。",
    ["stockInfo_Tsunami"] = "海啸防御系统是位于日本的四大武器制造商之一，被认为是世界顶级武器制造商之一。他们设计和生产武器和武器装备，无论是单兵还是企业军。",
    ["stockInfo_WNS"] = "WNS新闻是一家位于英国伦敦的媒体公司。 WNS新闻报道全世界各种方面的全部新闻，很多地方报纸都会付费从WNS购买报道。",
    ["stockInfo_Zetatech"] = "泽塔科技曾是一家规模较小的公司，总部设在库比蒂诺。泽塔科技一直在加州夜之城保持着强大的影响力。该公司专门从事于计算机硬件、软件和后台设计，是美国市场上神经处理器、微芯片和机器人的主要供应商之一。他们的产品包罗万象，从义体到网络接入仓，再到电脑。",
}

return localization